{
    "train_params": {
        "epochs": 200,
        "callbacks": [
            {
                "class_name": "EarlyStopping",
                "config": {
                    "monitor": "val_loss",
                    "patience": 30
                }
            }
        ]
    },
    "dataset_params": {
        "class_name": "H5Reader",
        "config": {
            "filename": "/home/work/ngochuyn/hn_delin/headneck_2d_full.h5",
            "batch_size": 16,
            "x_name": "input",
            "y_name": "class",
            "batch_cache": 10,
            "shuffle": true,
            "train_folds": [
                0,
                1,
                2,
                3,
                4,
                5,
                6,
                7,
                8,
                9
            ],
            "val_folds": [
                10
            ],
            "test_folds": [
                11,
                12,
                13
            ],
            "preprocessors": [
                {
                    "class_name": "HounsfieldWindowingPreprocessor",
                    "config": {
                        "window_center": 70,
                        "window_width": 200,
                        "channel": 0
                    }
                },
                {
                    "class_name": "ImageNormalizerPreprocessor",
                    "config": {
                        "vmin": [
                            -100,
                            0
                        ],
                        "vmax": [
                            100,
                            10
                        ]
                    }
                }
            ],
            "augmentations": {
                "class_name": "ClassImageAugmentation2D",
                "config": {
                    "rotation_range": 90,
                    "zoom_range": [
                        0.8,
                        1.2
                    ],
                    "shift_range": [
                        10,
                        10
                    ],
                    "flip_axis": 0,
                    "brightness_range": [
                        0.8,
                        1.2
                    ],
                    "contrast_range": [
                        0.7,
                        1.3
                    ],
                    "noise_variance": 0.05,
                    "noise_channel": 1,
                    "blur_range": [
                        0.5,
                        1.5
                    ],
                    "blur_channel": 1
                }
            }
        }
    },
    "input_params": {
        "shape": [
            191,
            265,
            2
        ]
    },
    "model_params": {
        "loss": {
            "class_name": "BinaryMacroFbetaLoss"
        },
        "optimizer": {
            "class_name": "adam",
            "config": {
                "learning_rate": 0.0001
            }
        },
        "metrics": [
            {
                "class_name": "BinaryFbeta"
            },
            {
                "class_name": "BinaryCrossentropy"
            },
            {
                "class_name": "TruePositives",
                "config": {
                    "name": "TP"
                }
            },
            {
                "class_name": "FalsePositives",
                "config": {
                    "name": "FP"
                }
            },
            {
                "class_name": "FalseNegatives",
                "config": {
                    "name": "FN"
                }
            }
        ]
    },
    "architecture": {
        "type": "Sequential",
        "layers": [
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "MaxPooling2D"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 128,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 128,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "MaxPooling2D"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 256,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 256,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 256,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "MaxPooling2D"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 512,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 512,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 512,
                    "kernel_size": 3,
                    "activation": "relu"
                }
            },
            {
                "class_name": "MaxPooling2D"
            },
            {
                "class_name": "Flatten"
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 2048,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 2048,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 1,
                    "activation": "sigmoid"
                }
            }
        ]
    }
}
