{"train_params": {"epochs": 200, "callbacks": []}, "dataset_params": {"class_name": "H5Reader", "config": {"filename": "/home/work/ngochuyn/hn_delin/outcome_all.h5", "batch_size": 4, "batch_cache": 7, "x_name": "clinical", "y_name": "DFS", "train_folds": [0, 2, 3], "val_folds": [1], "test_folds": [4], "shuffle": true, "preprocessors": [{"class_name": "ZScoreDensePreprocessor", "config": {"mean": [60, 0, 0, 0, 0, 0, 0, 0, 0, 22, 0, 11, 11, 110], "std": [10, 0, 0, 0, 0, 0, 0, 0, 0, 20, 0, 5, 12, 100]}}, {"class_name": "ChannelSelector", "config": {"channel": [7, 9, 10, 3, 5, 2, 1, 8, 0, 11]}}], "augmentations": []}}, "input_params": {"shape": [10]}, "model_params": {"loss": {"class_name": "BinaryCrossentropy", "config": {}}, "optimizer": {"class_name": "adam", "config": {"learning_rate": 0.001, "epsilon": 0.1}}, "metrics": [{"class_name": "BinaryFbeta"}, {"class_name": "AUC"}, {"class_name": "BinaryCrossentropy"}, {"class_name": "TruePositives", "config": {"name": "TP"}}, {"class_name": "FalsePositives", "config": {"name": "FP"}}, {"class_name": "TrueNegatives", "config": {"name": "TN"}}, {"class_name": "FalseNegatives", "config": {"name": "FN"}}]}, "architecture": {"type": "Generic", "layers": [{"class_name": "Dense", "config": {"units": 64, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 32, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 16, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 8, "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.25}}, {"class_name": "Dense", "config": {"units": 1, "activation": "sigmoid"}}]}}