{"train_params": {"epochs": 200, "callbacks": []}, "dataset_params": {"class_name": "H5Reader", "config": {"filename": "/home/work/ngochuyn/hn_delin/outcome_all.h5", "batch_size": 4, "batch_cache": 7, "x_name": "clinical", "y_name": "DFS", "train_folds": [0, 2, 4], "val_folds": [1], "test_folds": [3], "shuffle": true, "preprocessors": [{"class_name": "ZScoreDensePreprocessor", "config": {"mean": [60, 0, 0, 0, 0, 0, 0, 0, 0, 22, 0, 11, 11, 110], "std": [10, 0, 0, 0, 0, 0, 0, 0, 0, 20, 0, 5, 12, 100]}}, {"class_name": "ChannelSelector", "config": {"channel": [7]}}], "augmentations": []}}, "input_params": {"shape": [1]}, "model_params": {"loss": {"class_name": "BinaryCrossentropy", "config": {}}, "optimizer": {"class_name": "adam", "config": {"learning_rate": 0.001, "epsilon": 0.1}}, "metrics": [{"class_name": "BinaryFbeta"}, {"class_name": "AUC"}, {"class_name": "BinaryCrossentropy"}, {"class_name": "TruePositives", "config": {"name": "TP"}}, {"class_name": "FalsePositives", "config": {"name": "FP"}}, {"class_name": "TrueNegatives", "config": {"name": "TN"}}, {"class_name": "FalseNegatives", "config": {"name": "FN"}}]}, "architecture": {"type": "Generic", "layers": [{"name": "stem", "class_name": "GaussianNoise", "config": {"stddev": 0.05}}, {"name": "path_1_dense_1", "class_name": "Dense", "config": {"units": 8, "activation": "swish"}}, {"class_name": "Dropout", "config": {"rate": 0.3}}, {"name": "path_1_dense_2", "class_name": "Dense", "config": {"units": 8, "activation": "swish"}}, {"class_name": "Add", "inputs": ["path_1_dense_1", "path_1_dense_2"]}, {"name": "path_1_out", "class_name": "Dropout", "config": {"rate": 0.3}}, {"name": "path_2_dense_1", "class_name": "Dense", "config": {"units": 8, "activation": "swish"}, "inputs": ["stem"]}, {"class_name": "Dropout", "config": {"rate": 0.3}}, {"name": "path_2_dense_2", "class_name": "Dense", "config": {"units": 8, "activation": "swish"}}, {"class_name": "Add", "inputs": ["path_2_dense_1", "path_2_dense_2"]}, {"name": "path_2_out", "class_name": "Dropout", "config": {"rate": 0.3}}, {"name": "path_3_dense_1", "class_name": "Dense", "config": {"units": 8, "activation": "swish"}, "inputs": ["stem"]}, {"class_name": "Dropout", "config": {"rate": 0.3}}, {"name": "path_3_dense_2", "class_name": "Dense", "config": {"units": 8, "activation": "swish"}}, {"class_name": "Add", "inputs": ["path_3_dense_1", "path_3_dense_2"]}, {"name": "path_3_out", "class_name": "Dropout", "config": {"rate": 0.3}}, {"name": "add_12", "class_name": "Add", "inputs": ["path_1_out", "path_2_out"]}, {"name": "mul_12", "class_name": "Multiply", "inputs": ["path_1_out", "path_2_out"]}, {"name": "mul_13", "class_name": "Multiply", "inputs": ["path_1_out", "path_3_out"]}, {"name": "mul_23", "class_name": "Multiply", "inputs": ["path_2_out", "path_3_out"]}, {"name": "mul_123", "class_name": "Multiply", "inputs": ["path_1_out", "path_2_out", "path_3_out"]}, {"class_name": "Concatenate", "inputs": ["stem", "path_1_out", "path_2_out", "path_3_out", "mul_12", "mul_13", "mul_23", "mul_123"]}, {"class_name": "Dropout", "config": {"rate": 0.5}}, {"class_name": "Dense", "config": {"units": 32, "activation": "swish"}}, {"class_name": "Dropout", "config": {"rate": 0.25}}, {"class_name": "Dense", "config": {"units": 16, "activation": "swish"}}, {"class_name": "Dropout", "config": {"rate": 0.25}}, {"class_name": "Dense", "config": {"units": 1, "activation": "sigmoid"}}]}}