{
    "type": "Unet",
    "layers": [
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 48,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 48,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            },
            "name": "conv1"
        },
        {
            "class_name": "MaxPooling2D"
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 96,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 96,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            },
            "name": "conv2"
        },
        {
            "class_name": "MaxPooling2D"
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 192,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 192,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            },
            "name": "conv3"
        },
        {
            "class_name": "MaxPooling2D"
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 384,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 384,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            },
            "name": "conv4"
        },
        {
            "class_name": "MaxPooling2D"
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 768,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 768,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "name": "upconv4",
            "class_name": "Conv2DTranspose",
            "config": {
                "filters": 384,
                "kernel_size": 3,
                "strides": 1,
                "kernel_initializer": "he_normal",
                "padding": "same"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 384,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            },
            "inputs": [
                "conv4",
                "upconv4"
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 384,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "name": "upconv3",
            "class_name": "Conv2DTranspose",
            "config": {
                "filters": 192,
                "kernel_size": 3,
                "strides": 1,
                "kernel_initializer": "he_normal",
                "padding": "same"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 192,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            },
            "inputs": [
                "conv3",
                "upconv3"
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 192,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "name": "upconv2",
            "class_name": "Conv2DTranspose",
            "config": {
                "filters": 96,
                "kernel_size": 3,
                "strides": 1,
                "kernel_initializer": "he_normal",
                "padding": "same"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 96,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            },
            "inputs": [
                "conv2",
                "upconv2"
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 96,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "name": "upconv1",
            "class_name": "Conv2DTranspose",
            "config": {
                "filters": 48,
                "kernel_size": 3,
                "strides": 1,
                "kernel_initializer": "he_normal",
                "padding": "same"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 48,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            },
            "inputs": [
                "conv1",
                "upconv1"
            ]
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 48,
                "kernel_size": 3,
                "activation": "relu",
                "kernel_initializer": "he_normal",
                "padding": "same"
            },
            "normalizer": {
                "class_name": "BatchNormalization"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "filters": 1,
                "kernel_size": 3,
                "activation": "sigmoid",
                "kernel_initializer": "he_normal",
                "padding": "same"
            }
        }
    ]
}
