{"type": "Unet", "layers": [{"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv1"}, {"class_name": "MaxPooling2D"}, {"class_name": "Dropout", "config": {"rate": 0.5}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv2"}, {"class_name": "MaxPooling2D"}, {"class_name": "Dropout", "config": {"rate": 0.5}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv3"}, {"class_name": "MaxPooling2D"}, {"class_name": "Dropout", "config": {"rate": 0.5}}, {"class_name": "Conv2D", "config": {"filters": 512, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 512, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv3", "class_name": "Conv2DTranspose", "config": {"filters": 256, "kernel_size": 3, "strides": 1, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.5}, "inputs": ["conv3", "upconv3"]}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv2", "class_name": "Conv2DTranspose", "config": {"filters": 128, "kernel_size": 3, "strides": 1, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.5}, "inputs": ["conv2", "upconv2"]}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv1", "class_name": "Conv2DTranspose", "config": {"filters": 64, "kernel_size": 3, "strides": 1, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.5}, "inputs": ["conv1", "upconv1"]}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 1, "kernel_size": 3, "activation": "sigmoid", "kernel_initializer": "he_normal", "padding": "same"}}]}