{"type": "ResNet", "layers": [{"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "pool1", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "pool2", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "pool3", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "pool4", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv3", "class_name": "Conv2DTranspose", "config": {"filters": 48, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "inputs": ["pool3", "upconv3"]}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv2", "class_name": "Conv2DTranspose", "config": {"filters": 48, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "inputs": ["pool2", "upconv2"]}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv1", "class_name": "Conv2DTranspose", "config": {"filters": 48, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "inputs": ["pool1", "upconv1"]}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2DTranspose", "config": {"filters": 48, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "resize_inputs": true}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 1, "kernel_size": 3, "activation": "sigmoid", "kernel_initializer": "he_normal", "padding": "same"}}]}