{"train_params": {"epochs": 200, "callbacks": [{"class_name": "EarlyStopping", "config": {"monitor": "val_loss", "patience": 30}}]}, "dataset_params": {"class_name": "H5PatchReader", "config": {"filename": "/home/work/ngochuyn/hn_delin/headneck_3d_new.h5", "batch_size": 4, "patch_size": 112, "batch_cache": 5, "x_name": "input", "y_name": "target", "train_folds": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9], "val_folds": [10], "test_folds": [11, 12, 13], "shuffle": true, "overlap": 0.5, "drop_fraction": 0.0007, "check_drop_channel": 0, "preprocessors": [{"class_name": "HounsfieldWindowingPreprocessor", "config": {"window_center": 70, "window_width": 200, "channel": 0}}, {"class_name": "ImageNormalizerPreprocessor", "config": {"vmin": [-100, 0], "vmax": [100, 25]}}], "augmentations": {"class_name": "ImageAugmentation3D", "config": {"rotation_range": 90, "zoom_range": [0.8, 1.2], "shift_range": [10, 10, 10], "flip_axis": 1, "brightness_range": [0.8, 1.2], "contrast_range": [0.7, 1.3], "noise_variance": 0.05, "noise_channel": 1, "blur_range": [0.5, 1.5], "blur_channel": 1}}, "bounding_box": true}}, "input_params": {"shape": [112, 112, 112, 2]}, "model_params": {"loss": {"class_name": "BinaryFbetaLoss"}, "optimizer": {"class_name": "adam", "config": {"learning_rate": 0.0001}}, "metrics": [{"class_name": "BinaryFbeta"}, {"class_name": "Dice"}]}, "architecture": {"type": "VoxResNet", "layers": [{"name": "conv_1_1_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["input"]}, {"name": "SE_block_1_1_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_1_1_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_1_1_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_1_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}}, {"name": "SE_block_1_1_gamma", "class_name": "Dense", "config": {"units": 24, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_1_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_1_1_beta", "class_name": "Dense", "config": {"units": 24, "activation": "tanh"}}, {"name": "SE_block_1_1_preout", "class_name": "Multiply", "inputs": ["SE_block_1_1_in", "SE_block_1_1_gamma"]}, {"name": "SE_block_1_1_out", "class_name": "Add", "inputs": ["SE_block_1_1_preout", "SE_block_1_1_beta"]}, {"name": "conv_1_2_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["input"]}, {"name": "SE_block_1_2_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_1_2_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_1_2_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_1_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}}, {"name": "SE_block_1_2_gamma", "class_name": "Dense", "config": {"units": 24, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_1_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_1_2_beta", "class_name": "Dense", "config": {"units": 24, "activation": "tanh"}}, {"name": "SE_block_1_2_preout", "class_name": "Multiply", "inputs": ["SE_block_1_2_in", "SE_block_1_2_gamma"]}, {"name": "SE_block_1_2_out", "class_name": "Add", "inputs": ["SE_block_1_2_preout", "SE_block_1_2_beta"]}, {"name": "conv_1_out", "class_name": "Add", "inputs": ["SE_block_1_1_out", "SE_block_1_2_out"]}, {"name": "conv_2_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_2_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_2_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_2_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}}, {"name": "SE_block_2_gamma", "class_name": "Dense", "config": {"units": 24, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_2_beta", "class_name": "Dense", "config": {"units": 24, "activation": "tanh"}}, {"name": "SE_block_2_preout", "class_name": "Multiply", "inputs": ["SE_block_2_in", "SE_block_2_gamma"]}, {"name": "SE_block_2_out", "class_name": "Add", "inputs": ["SE_block_2_preout", "SE_block_2_beta"]}, {"name": "conv_2_out", "class_name": "Add", "inputs": ["conv_1_out", "SE_block_2_out"]}, {"name": "maxpool_1", "class_name": "MaxPooling3D"}, {"name": "conv_3_1_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["maxpool_1"]}, {"name": "SE_block_3_1_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_3_1_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_3_1_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_3_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}}, {"name": "SE_block_3_1_gamma", "class_name": "Dense", "config": {"units": 48, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_3_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_3_1_beta", "class_name": "Dense", "config": {"units": 48, "activation": "tanh"}}, {"name": "SE_block_3_1_preout", "class_name": "Multiply", "inputs": ["SE_block_3_1_in", "SE_block_3_1_gamma"]}, {"name": "SE_block_3_1_out", "class_name": "Add", "inputs": ["SE_block_3_1_preout", "SE_block_3_1_beta"]}, {"name": "conv_3_2_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["maxpool_1"]}, {"name": "SE_block_3_2_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_3_2_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_3_2_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_3_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}}, {"name": "SE_block_3_2_gamma", "class_name": "Dense", "config": {"units": 48, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_3_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_3_2_beta", "class_name": "Dense", "config": {"units": 48, "activation": "tanh"}}, {"name": "SE_block_3_2_preout", "class_name": "Multiply", "inputs": ["SE_block_3_2_in", "SE_block_3_2_gamma"]}, {"name": "SE_block_3_2_out", "class_name": "Add", "inputs": ["SE_block_3_2_preout", "SE_block_3_2_beta"]}, {"name": "conv_3_out", "class_name": "Add", "inputs": ["SE_block_3_1_out", "SE_block_3_2_out"]}, {"name": "conv_4_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_4_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_4_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_4_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_4_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}}, {"name": "SE_block_4_gamma", "class_name": "Dense", "config": {"units": 48, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_4_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_4_beta", "class_name": "Dense", "config": {"units": 48, "activation": "tanh"}}, {"name": "SE_block_4_preout", "class_name": "Multiply", "inputs": ["SE_block_4_in", "SE_block_4_gamma"]}, {"name": "SE_block_4_out", "class_name": "Add", "inputs": ["SE_block_4_preout", "SE_block_4_beta"]}, {"name": "conv_4_out", "class_name": "Add", "inputs": ["conv_3_out", "SE_block_4_out"]}, {"name": "conv_5_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_5_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_5_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_5_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_5_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}}, {"name": "SE_block_5_gamma", "class_name": "Dense", "config": {"units": 48, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_5_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_5_beta", "class_name": "Dense", "config": {"units": 48, "activation": "tanh"}}, {"name": "SE_block_5_preout", "class_name": "Multiply", "inputs": ["SE_block_5_in", "SE_block_5_gamma"]}, {"name": "SE_block_5_out", "class_name": "Add", "inputs": ["SE_block_5_preout", "SE_block_5_beta"]}, {"name": "conv_5_out", "class_name": "Add", "inputs": ["conv_4_out", "SE_block_5_out"]}, {"name": "maxpool_2", "class_name": "MaxPooling3D"}, {"name": "conv_6_1_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["maxpool_2"]}, {"name": "SE_block_6_1_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_6_1_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_6_1_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_6_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}}, {"name": "SE_block_6_1_gamma", "class_name": "Dense", "config": {"units": 96, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_6_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_6_1_beta", "class_name": "Dense", "config": {"units": 96, "activation": "tanh"}}, {"name": "SE_block_6_1_preout", "class_name": "Multiply", "inputs": ["SE_block_6_1_in", "SE_block_6_1_gamma"]}, {"name": "SE_block_6_1_out", "class_name": "Add", "inputs": ["SE_block_6_1_preout", "SE_block_6_1_beta"]}, {"name": "conv_6_2_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["maxpool_2"]}, {"name": "SE_block_6_2_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_6_2_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_6_2_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_6_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}}, {"name": "SE_block_6_2_gamma", "class_name": "Dense", "config": {"units": 96, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_6_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_6_2_beta", "class_name": "Dense", "config": {"units": 96, "activation": "tanh"}}, {"name": "SE_block_6_2_preout", "class_name": "Multiply", "inputs": ["SE_block_6_2_in", "SE_block_6_2_gamma"]}, {"name": "SE_block_6_2_out", "class_name": "Add", "inputs": ["SE_block_6_2_preout", "SE_block_6_2_beta"]}, {"name": "conv_6_out", "class_name": "Add", "inputs": ["SE_block_6_1_out", "SE_block_6_2_out"]}, {"name": "conv_7_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_7_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_7_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_7_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_7_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}}, {"name": "SE_block_7_gamma", "class_name": "Dense", "config": {"units": 96, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_7_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_7_beta", "class_name": "Dense", "config": {"units": 96, "activation": "tanh"}}, {"name": "SE_block_7_preout", "class_name": "Multiply", "inputs": ["SE_block_7_in", "SE_block_7_gamma"]}, {"name": "SE_block_7_out", "class_name": "Add", "inputs": ["SE_block_7_preout", "SE_block_7_beta"]}, {"name": "conv_7_out", "class_name": "Add", "inputs": ["conv_6_out", "SE_block_7_out"]}, {"name": "conv_8_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_8_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_8_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_8_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_8_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}}, {"name": "SE_block_8_gamma", "class_name": "Dense", "config": {"units": 96, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_8_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_8_beta", "class_name": "Dense", "config": {"units": 96, "activation": "tanh"}}, {"name": "SE_block_8_preout", "class_name": "Multiply", "inputs": ["SE_block_8_in", "SE_block_8_gamma"]}, {"name": "SE_block_8_out", "class_name": "Add", "inputs": ["SE_block_8_preout", "SE_block_8_beta"]}, {"name": "conv_8_out", "class_name": "Add", "inputs": ["conv_7_out", "SE_block_8_out"]}, {"name": "maxpool_3", "class_name": "MaxPooling3D"}, {"name": "conv_9_1_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["maxpool_3"]}, {"name": "SE_block_9_1_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_9_1_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_9_1_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_9_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}}, {"name": "SE_block_9_1_gamma", "class_name": "Dense", "config": {"units": 192, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_9_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_9_1_beta", "class_name": "Dense", "config": {"units": 192, "activation": "tanh"}}, {"name": "SE_block_9_1_preout", "class_name": "Multiply", "inputs": ["SE_block_9_1_in", "SE_block_9_1_gamma"]}, {"name": "SE_block_9_1_out", "class_name": "Add", "inputs": ["SE_block_9_1_preout", "SE_block_9_1_beta"]}, {"name": "conv_9_2_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["maxpool_3"]}, {"name": "SE_block_9_2_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_9_2_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_9_2_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_9_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}}, {"name": "SE_block_9_2_gamma", "class_name": "Dense", "config": {"units": 192, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_9_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_9_2_beta", "class_name": "Dense", "config": {"units": 192, "activation": "tanh"}}, {"name": "SE_block_9_2_preout", "class_name": "Multiply", "inputs": ["SE_block_9_2_in", "SE_block_9_2_gamma"]}, {"name": "SE_block_9_2_out", "class_name": "Add", "inputs": ["SE_block_9_2_preout", "SE_block_9_2_beta"]}, {"name": "conv_9_out", "class_name": "Add", "inputs": ["SE_block_9_1_out", "SE_block_9_2_out"]}, {"name": "conv_10_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_10_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_10_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_10_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_10_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}}, {"name": "SE_block_10_gamma", "class_name": "Dense", "config": {"units": 192, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_10_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_10_beta", "class_name": "Dense", "config": {"units": 192, "activation": "tanh"}}, {"name": "SE_block_10_preout", "class_name": "Multiply", "inputs": ["SE_block_10_in", "SE_block_10_gamma"]}, {"name": "SE_block_10_out", "class_name": "Add", "inputs": ["SE_block_10_preout", "SE_block_10_beta"]}, {"name": "conv_10_out", "class_name": "Add", "inputs": ["conv_9_out", "SE_block_10_out"]}, {"name": "conv_11_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_11_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_11_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_11_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_11_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}}, {"name": "SE_block_11_gamma", "class_name": "Dense", "config": {"units": 192, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_11_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_11_beta", "class_name": "Dense", "config": {"units": 192, "activation": "tanh"}}, {"name": "SE_block_11_preout", "class_name": "Multiply", "inputs": ["SE_block_11_in", "SE_block_11_gamma"]}, {"name": "SE_block_11_out", "class_name": "Add", "inputs": ["SE_block_11_preout", "SE_block_11_beta"]}, {"name": "conv_11_out", "class_name": "Add", "inputs": ["conv_10_out", "SE_block_11_out"]}, {"name": "maxpool_4", "class_name": "MaxPooling3D"}, {"name": "conv_12_1_in", "class_name": "Conv3D", "config": {"filters": 384, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["maxpool_4"]}, {"name": "SE_block_12_1_in", "class_name": "Conv3D", "config": {"filters": 384, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_12_1_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_12_1_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_12_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 384]}}, {"class_name": "Dense", "config": {"units": 192, "activation": "relu"}}, {"name": "SE_block_12_1_gamma", "class_name": "Dense", "config": {"units": 384, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_12_1_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 384]}}, {"class_name": "Dense", "config": {"units": 192, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_12_1_beta", "class_name": "Dense", "config": {"units": 384, "activation": "tanh"}}, {"name": "SE_block_12_1_preout", "class_name": "Multiply", "inputs": ["SE_block_12_1_in", "SE_block_12_1_gamma"]}, {"name": "SE_block_12_1_out", "class_name": "Add", "inputs": ["SE_block_12_1_preout", "SE_block_12_1_beta"]}, {"name": "conv_12_2_in", "class_name": "Conv3D", "config": {"filters": 384, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["maxpool_4"]}, {"name": "SE_block_12_2_in", "class_name": "Conv3D", "config": {"filters": 384, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_12_2_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_12_2_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_12_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 384]}}, {"class_name": "Dense", "config": {"units": 192, "activation": "relu"}}, {"name": "SE_block_12_2_gamma", "class_name": "Dense", "config": {"units": 384, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_12_2_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 384]}}, {"class_name": "Dense", "config": {"units": 192, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_12_2_beta", "class_name": "Dense", "config": {"units": 384, "activation": "tanh"}}, {"name": "SE_block_12_2_preout", "class_name": "Multiply", "inputs": ["SE_block_12_2_in", "SE_block_12_2_gamma"]}, {"name": "SE_block_12_2_out", "class_name": "Add", "inputs": ["SE_block_12_2_preout", "SE_block_12_2_beta"]}, {"name": "conv_12_out", "class_name": "Add", "inputs": ["SE_block_12_1_out", "SE_block_12_2_out"]}, {"name": "conv_13_in", "class_name": "Conv3D", "config": {"filters": 384, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_13_in", "class_name": "Conv3D", "config": {"filters": 384, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_13_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_13_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_13_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 384]}}, {"class_name": "Dense", "config": {"units": 192, "activation": "relu"}}, {"name": "SE_block_13_gamma", "class_name": "Dense", "config": {"units": 384, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_13_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 384]}}, {"class_name": "Dense", "config": {"units": 192, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_13_beta", "class_name": "Dense", "config": {"units": 384, "activation": "tanh"}}, {"name": "SE_block_13_preout", "class_name": "Multiply", "inputs": ["SE_block_13_in", "SE_block_13_gamma"]}, {"name": "SE_block_13_out", "class_name": "Add", "inputs": ["SE_block_13_preout", "SE_block_13_beta"]}, {"name": "conv_13_out", "class_name": "Add", "inputs": ["conv_12_out", "SE_block_13_out"]}, {"name": "conv_14_in", "class_name": "Conv3D", "config": {"filters": 384, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_14_in", "class_name": "Conv3D", "config": {"filters": 384, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_14_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_14_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_14_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 384]}}, {"class_name": "Dense", "config": {"units": 192, "activation": "relu"}}, {"name": "SE_block_14_gamma", "class_name": "Dense", "config": {"units": 384, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_14_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 384]}}, {"class_name": "Dense", "config": {"units": 192, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_14_beta", "class_name": "Dense", "config": {"units": 384, "activation": "tanh"}}, {"name": "SE_block_14_preout", "class_name": "Multiply", "inputs": ["SE_block_14_in", "SE_block_14_gamma"]}, {"name": "SE_block_14_out", "class_name": "Add", "inputs": ["SE_block_14_preout", "SE_block_14_beta"]}, {"name": "conv_14_out", "class_name": "Add", "inputs": ["conv_13_out", "SE_block_14_out"]}, {"name": "upconv_1", "class_name": "Conv3DTranspose", "config": {"filters": 192, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "conv_15_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["upconv_1", "conv_11_out"]}, {"name": "SE_block_15_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_15_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_15_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_15_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}}, {"name": "SE_block_15_gamma", "class_name": "Dense", "config": {"units": 192, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_15_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_15_beta", "class_name": "Dense", "config": {"units": 192, "activation": "tanh"}}, {"name": "SE_block_15_preout", "class_name": "Multiply", "inputs": ["SE_block_15_in", "SE_block_15_gamma"]}, {"name": "SE_block_15_out", "class_name": "Add", "inputs": ["SE_block_15_preout", "SE_block_15_beta"]}, {"name": "conv_16_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_16_in", "class_name": "Conv3D", "config": {"filters": 192, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_16_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_16_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_16_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}}, {"name": "SE_block_16_gamma", "class_name": "Dense", "config": {"units": 192, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_16_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 192]}}, {"class_name": "Dense", "config": {"units": 96, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_16_beta", "class_name": "Dense", "config": {"units": 192, "activation": "tanh"}}, {"name": "SE_block_16_preout", "class_name": "Multiply", "inputs": ["SE_block_16_in", "SE_block_16_gamma"]}, {"name": "SE_block_16_out", "class_name": "Add", "inputs": ["SE_block_16_preout", "SE_block_16_beta"]}, {"name": "upconv_2", "class_name": "Conv3DTranspose", "config": {"filters": 96, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "conv_17_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["upconv_2", "conv_8_out"]}, {"name": "SE_block_17_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_17_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_17_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_17_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}}, {"name": "SE_block_17_gamma", "class_name": "Dense", "config": {"units": 96, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_17_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_17_beta", "class_name": "Dense", "config": {"units": 96, "activation": "tanh"}}, {"name": "SE_block_17_preout", "class_name": "Multiply", "inputs": ["SE_block_17_in", "SE_block_17_gamma"]}, {"name": "SE_block_17_out", "class_name": "Add", "inputs": ["SE_block_17_preout", "SE_block_17_beta"]}, {"name": "conv_18_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_18_in", "class_name": "Conv3D", "config": {"filters": 96, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_18_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_18_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_18_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}}, {"name": "SE_block_18_gamma", "class_name": "Dense", "config": {"units": 96, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_18_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 96]}}, {"class_name": "Dense", "config": {"units": 48, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_18_beta", "class_name": "Dense", "config": {"units": 96, "activation": "tanh"}}, {"name": "SE_block_18_preout", "class_name": "Multiply", "inputs": ["SE_block_18_in", "SE_block_18_gamma"]}, {"name": "SE_block_18_out", "class_name": "Add", "inputs": ["SE_block_18_preout", "SE_block_18_beta"]}, {"name": "upconv_3", "class_name": "Conv3DTranspose", "config": {"filters": 48, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "conv_19_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["upconv_3", "conv_5_out"]}, {"name": "SE_block_19_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_19_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_19_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_19_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}}, {"name": "SE_block_19_gamma", "class_name": "Dense", "config": {"units": 48, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_19_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_19_beta", "class_name": "Dense", "config": {"units": 48, "activation": "tanh"}}, {"name": "SE_block_19_preout", "class_name": "Multiply", "inputs": ["SE_block_19_in", "SE_block_19_gamma"]}, {"name": "SE_block_19_out", "class_name": "Add", "inputs": ["SE_block_19_preout", "SE_block_19_beta"]}, {"name": "conv_20_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_20_in", "class_name": "Conv3D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_20_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_20_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_20_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}}, {"name": "SE_block_20_gamma", "class_name": "Dense", "config": {"units": 48, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_20_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 48]}}, {"class_name": "Dense", "config": {"units": 24, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_20_beta", "class_name": "Dense", "config": {"units": 48, "activation": "tanh"}}, {"name": "SE_block_20_preout", "class_name": "Multiply", "inputs": ["SE_block_20_in", "SE_block_20_gamma"]}, {"name": "SE_block_20_out", "class_name": "Add", "inputs": ["SE_block_20_preout", "SE_block_20_beta"]}, {"name": "upconv_4", "class_name": "Conv3DTranspose", "config": {"filters": 24, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "conv_21_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["upconv_4", "conv_2_out"]}, {"name": "SE_block_21_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_21_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_21_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_21_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}}, {"name": "SE_block_21_gamma", "class_name": "Dense", "config": {"units": 24, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_21_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_21_beta", "class_name": "Dense", "config": {"units": 24, "activation": "tanh"}}, {"name": "SE_block_21_preout", "class_name": "Multiply", "inputs": ["SE_block_21_in", "SE_block_21_gamma"]}, {"name": "SE_block_21_out", "class_name": "Add", "inputs": ["SE_block_21_preout", "SE_block_21_beta"]}, {"name": "conv_22_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["SE_block_20_out"]}, {"name": "SE_block_22_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_22_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_22_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_22_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}}, {"name": "SE_block_22_gamma", "class_name": "Dense", "config": {"units": 24, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_22_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_22_beta", "class_name": "Dense", "config": {"units": 24, "activation": "tanh"}}, {"name": "SE_block_22_preout", "class_name": "Multiply", "inputs": ["SE_block_22_in", "SE_block_22_gamma"]}, {"name": "SE_block_22_out", "class_name": "Add", "inputs": ["SE_block_22_preout", "SE_block_22_beta"]}, {"name": "conv_23_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["SE_block_18_out"]}, {"name": "SE_block_23_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_23_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_23_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_23_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}}, {"name": "SE_block_23_gamma", "class_name": "Dense", "config": {"units": 24, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_23_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_23_beta", "class_name": "Dense", "config": {"units": 24, "activation": "tanh"}}, {"name": "SE_block_23_preout", "class_name": "Multiply", "inputs": ["SE_block_23_in", "SE_block_23_gamma"]}, {"name": "SE_block_23_out", "class_name": "Add", "inputs": ["SE_block_23_preout", "SE_block_23_beta"]}, {"name": "conv_24_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "inputs": ["SE_block_16_out"]}, {"name": "SE_block_24_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 1, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_24_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_24_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_24_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}}, {"name": "SE_block_24_gamma", "class_name": "Dense", "config": {"units": 24, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_24_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_24_beta", "class_name": "Dense", "config": {"units": 24, "activation": "tanh"}}, {"name": "SE_block_24_preout", "class_name": "Multiply", "inputs": ["SE_block_24_in", "SE_block_24_gamma"]}, {"name": "SE_block_24_out", "class_name": "Add", "inputs": ["SE_block_24_preout", "SE_block_24_beta"]}, {"class_name": "AddResize", "inputs": ["SE_block_21_out", "SE_block_22_out", "SE_block_23_out", "SE_block_24_out"]}, {"name": "conv_25_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_25_in", "class_name": "Conv3D", "config": {"filters": 24, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}}, {"name": "SE_block_25_norm", "class_name": "InstanceNormalization", "inputs": ["SE_block_25_in"]}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_25_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}}, {"name": "SE_block_25_gamma", "class_name": "Dense", "config": {"units": 24, "activation": "sigmoid"}}, {"class_name": "GlobalAvgPool3D", "inputs": ["SE_block_25_in"]}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 1, 24]}}, {"class_name": "Dense", "config": {"units": 12, "activation": "relu"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "SE_block_25_beta", "class_name": "Dense", "config": {"units": 24, "activation": "tanh"}}, {"name": "SE_block_25_preout", "class_name": "Multiply", "inputs": ["SE_block_25_in", "SE_block_25_gamma"]}, {"name": "SE_block_25_out", "class_name": "Add", "inputs": ["SE_block_25_preout", "SE_block_25_beta"]}, {"class_name": "Conv3D", "config": {"filters": 1, "kernel_size": 1, "activation": "sigmoid", "kernel_initializer": "he_normal", "padding": "same"}}]}}