{"train_params": {"epochs": 200, "callbacks": [{"class_name": "EarlyStopping", "config": {"monitor": "val_loss", "patience": 30}}]}, "dataset_params": {"class_name": "H5PatchReader", "config": {"filename": "/home/work/ngochuyn/hn_delin/headneck_3d_new.h5", "batch_size": 4, "patch_size": 112, "batch_cache": 5, "x_name": "input", "y_name": "target", "train_folds": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9], "val_folds": [10], "test_folds": [11, 12, 13], "shuffle": true, "overlap": 0.5, "drop_fraction": 0.0007, "check_drop_channel": 0, "preprocessors": [{"class_name": "HounsfieldWindowingPreprocessor", "config": {"window_center": 70, "window_width": 200, "channel": 0}}, {"class_name": "ImageNormalizerPreprocessor", "config": {"vmin": [-100, 0], "vmax": [100, 10]}}], "bounding_box": true}}, "input_params": {"shape": [112, 112, 112, 2]}, "model_params": {"loss": {"class_name": "BinaryFbetaLoss"}, "optimizer": {"class_name": "adam", "config": {"learning_rate": 0.0001}}, "metrics": [{"class_name": "BinaryFbeta"}, {"class_name": "Dice"}]}, "architecture": {"type": "ResNet", "layers": [{"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "pool1", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "pool2", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "pool3", "class_name": "MaxPooling2D"}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"res_block": 2, "class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv2", "class_name": "Conv2DTranspose", "config": {"filters": 48, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "inputs": ["pool2", "upconv2"]}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv1", "class_name": "Conv2DTranspose", "config": {"filters": 48, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "inputs": ["pool1", "upconv1"]}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2DTranspose", "config": {"filters": 48, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "resize_inputs": true}, {"class_name": "Conv2D", "config": {"filters": 48, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 1, "kernel_size": 3, "activation": "sigmoid", "kernel_initializer": "he_normal", "padding": "same"}}]}}