{"train_params": {"epochs": 200, "callbacks": [{"class_name": "EarlyStopping", "config": {"monitor": "val_loss", "patience": 30}}]}, "dataset_params": {"class_name": "H5Reader", "config": {"filename": "/home/work/ngochuyn/hn_delin/full_dataset_single.h5", "batch_size": 16, "x_name": "input", "y_name": "target", "batch_cache": 10, "shuffle": true, "train_folds": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9], "val_folds": [10], "test_folds": [11, 12, 13], "preprocessors": [{"class_name": "HounsfieldWindowingPreprocessor", "config": {"window_center": 70, "window_width": 200, "channel": 0}}, {"class_name": "ImageNormalizerPreprocessor", "config": {"vmin": [-100, 0], "vmax": [100, 10]}}], "augmentations": {"class_name": "ImageAugmentation2D", "config": {"rotation_range": 90, "zoom_range": [0.5, 1.5], "shift_range": [10, 10], "flip_axis": 0}}}}, "input_params": {"shape": [191, 265, 2]}, "model_params": {"loss": {"class_name": "BinaryFbetaLoss"}, "optimizer": {"class_name": "adam", "config": {"learning_rate": 0.0001}}, "metrics": [{"class_name": "BinaryFbeta"}, {"class_name": "Dice"}]}, "architecture": {"type": "Unet", "layers": [{"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv1"}, {"class_name": "MaxPooling2D"}, {"class_name": "Dropout", "config": {"rate": 0.5}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv2"}, {"class_name": "MaxPooling2D"}, {"class_name": "Dropout", "config": {"rate": 0.5}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv3"}, {"class_name": "MaxPooling2D"}, {"class_name": "Dropout", "config": {"rate": 0.5}}, {"class_name": "Conv2D", "config": {"filters": 512, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 512, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv3", "class_name": "Conv2DTranspose", "config": {"filters": 256, "kernel_size": 3, "strides": 1, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.5}, "inputs": ["conv3", "upconv3"]}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv2", "class_name": "Conv2DTranspose", "config": {"filters": 128, "kernel_size": 3, "strides": 1, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.5}, "inputs": ["conv2", "upconv2"]}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv1", "class_name": "Conv2DTranspose", "config": {"filters": 64, "kernel_size": 3, "strides": 1, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Dropout", "config": {"rate": 0.5}, "inputs": ["conv1", "upconv1"]}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 1, "kernel_size": 3, "activation": "sigmoid", "kernel_initializer": "he_normal", "padding": "same"}}]}}