{
    "train_params": {
        "epochs": 200,
        "callbacks": [
            {
                "class_name": "EarlyStopping",
                "config": {
                    "monitor": "val_loss",
                    "patience": 30
                }
            }
        ]
    },
    "dataset_params": {
        "class_name": "H5Reader",
        "config": {
            "filename": "/mnt/users/ngochuyn/datasets/headneck/outcome.h5",
            "batch_size": 4,
            "batch_cache": 7,
            "x_name": "clinical",
            "y_name": "DFS",
            "train_folds": [
                1,
                2,
                3,
                4
            ],
            "val_folds": [
                0
            ],
            "test_folds": [
                0
            ],
            "shuffle": true,
            "preprocessors": [],
            "augmentations": []
        }
    },
    "input_params": {
        "shape": [
            11
        ]
    },
    "model_params": {
        "loss": {
            "class_name": "FusedLoss",
            "config": {
                "loss_configs": [
                    {
                        "class_name": "BinaryCrossentropy"
                    },
                    {
                        "class_name": "BinaryMacroFbetaLoss"
                    }
                ]
            }
        },
        "optimizer": {
            "class_name": "adam",
            "config": {
                "learning_rate": 0.0001
            }
        },
        "metrics": [
            {
                "class_name": "BinaryFbeta"
            },
            {
                "class_name": "AUC"
            },
            {
                "class_name": "BinaryCrossentropy"
            },
            {
                "class_name": "TruePositives",
                "config": {
                    "name": "TP"
                }
            },
            {
                "class_name": "FalsePositives",
                "config": {
                    "name": "FP"
                }
            },
            {
                "class_name": "TrueNegatives",
                "config": {
                    "name": "TN"
                }
            },
            {
                "class_name": "FalseNegatives",
                "config": {
                    "name": "FN"
                }
            }
        ]
    },
    "architecture": {
        "type": "MultiInputModelLoader",
        "layers": [
            {
                "class_name": "Dense",
                "config": {
                    "units": 32,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 64,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.5
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 64,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.5
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 32,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.5
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 16,
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 1,
                    "activation": "sigmoid"
                }
            }
        ]
    }
}
