{
    "train_params": {
        "epochs": 200,
        "callbacks": []
    },
    "dataset_params": {
        "class_name": "H5Reader",
        "config": {
            "filename": "/mnt/users/ngochuyn/datasets/headneck/outcome.h5",
            "batch_size": 4,
            "batch_cache": 7,
            "x_name": "clinical",
            "y_name": "DFS",
            "train_folds": [
                1,
                3,
                4
            ],
            "val_folds": [
                0
            ],
            "test_folds": [
                2
            ],
            "shuffle": true,
            "preprocessors": [
                {
                    "class_name": "ZScoreDensePreprocessor",
                    "config": {
                        "mean": [
                            60,
                            0,
                            0,
                            0,
                            0,
                            0,
                            0,
                            0,
                            0,
                            22,
                            0
                        ],
                        "std": [
                            10,
                            0,
                            0,
                            0,
                            0,
                            0,
                            0,
                            0,
                            0,
                            20,
                            0
                        ]
                    }
                }
            ],
            "augmentations": []
        }
    },
    "input_params": {
        "shape": [
            11
        ]
    },
    "model_params": {
        "loss": {
            "class_name": "BinaryCrossentropy",
            "config": {}
        },
        "optimizer": {
            "class_name": "adam",
            "config": {
                "learning_rate": 0.001
            }
        },
        "metrics": [
            {
                "class_name": "BinaryFbeta"
            },
            {
                "class_name": "AUC"
            },
            {
                "class_name": "BinaryCrossentropy"
            },
            {
                "class_name": "TruePositives",
                "config": {
                    "name": "TP"
                }
            },
            {
                "class_name": "FalsePositives",
                "config": {
                    "name": "FP"
                }
            },
            {
                "class_name": "TrueNegatives",
                "config": {
                    "name": "TN"
                }
            },
            {
                "class_name": "FalseNegatives",
                "config": {
                    "name": "FN"
                }
            }
        ]
    },
    "architecture": {
        "type": "Generic",
        "layers": [
            {
                "class_name": "Dense",
                "config": {
                    "units": 32,
                    "activation": "swish"
                }
            },
            {
                "name": "path_1",
                "class_name": "Dense",
                "config": {
                    "units": 16,
                    "activation": "swish"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 32,
                    "activation": "swish"
                },
                "inputs": [
                    "input_0"
                ]
            },
            {
                "name": "path_2",
                "class_name": "Dense",
                "config": {
                    "units": 16,
                    "activation": "swish"
                }
            },
            {
                "name": "add_12",
                "class_name": "Add",
                "inputs": [
                    "path_1",
                    "path_2"
                ]
            },
            {
                "name": "mul_12",
                "class_name": "Multiply",
                "inputs": [
                    "path_1",
                    "path_2"
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 32,
                    "activation": "swish"
                },
                "inputs": [
                    "input_0",
                    "path_1",
                    "path_2",
                    "add_12",
                    "mul_12"
                ]
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.25
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 8,
                    "activation": "swish"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "rate": 0.25
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 1,
                    "activation": "sigmoid"
                }
            }
        ]
    }
}
